In [171]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns
%matplotlib notebook

In [172]:
dataset=pd.read_csv("preprocessed2.csv")

In [173]:
dataset = dataset.rename(columns = {'Number of Bedrooms': 'No_of_Bedrooms'}, inplace = False)
dataset = dataset.rename(columns = {'Property Type': 'Property_Type'}, inplace = False)

In [174]:
dataset.describe()

,Unnamed: 0,TLIST(A1),Year,C03004V03625,VALUE
count,243516.000000,243516.000000,243516.000000,243516.000000,242970.000000
mean,121757.500000,2014.000000,2014.000000,139445.627803,926.736487
std,70297.158413,3.741665,3.741665,17471.757676,364.186646
min,0.000000,2008.000000,2008.000000,110000.000000,272.920000
25%,60878.750000,2011.000000,2011.000000,124600.000000,635.469385
50%,121757.500000,2014.000000,2014.000000,137850.000000,808.812197
75%,182636.250000,2017.000000,2017.000000,155400.000000,1182.669215
max,243515.000000,2020.000000,2020.000000,171200.000000,6522.480000

In [175]:
dataset.dropna(inplace=True)

In [176]:
dataset.describe()

,Unnamed: 0,TLIST(A1),Year,C03004V03625,VALUE
count,242970.000000,242970.000000,242970.000000,242970.000000,242970.000000
mean,121757.260674,2014.000000,2014.000000,139411.797753,926.736487
std,70297.158821,3.741665,3.741665,17476.780742,364.186646
min,0.000000,2008.000000,2008.000000,110000.000000,272.920000
25%,60878.250000,2011.000000,2011.000000,124600.000000,635.469385
50%,121757.500000,2014.000000,2014.000000,137800.000000,808.812197
75%,182635.750000,2017.000000,2017.000000,155400.000000,1182.669215
max,243515.000000,2020.000000,2020.000000,171200.000000,6522.480000

In [177]:
Number_of_Bedrooms	=pd.get_dummies(dataset['No_of_Bedrooms'])

In [178]:
Property_type=pd.get_dummies(dataset['Property_Type'])

In [179]:
Location_new=pd.get_dummies(dataset['Location'])

In [180]:
dataset=pd.concat([dataset,Location_new,Number_of_Bedrooms,Property_type],axis=1)

In [181]:
dataset.drop(['STATISTIC','Statistic','Year','TLIST(A1)','No_of_Bedrooms','C02969V03591','Property_Type','C02970V03592','UNIT','Location','C03004V03625'],axis=1,inplace=True)

In [182]:
dataset.head()

,Unnamed: 0,VALUE,check_for_nan,"Abbeyfeale, Limerick","Annacotty, Limerick","Arbour Hill, Dublin 7","Ardee, Louth","Arklow, Wicklow","Artane, Dublin 5","Ashbourne, Meath",...,Four plus bed,One bed,Three bed,Two bed,All property types,Apartment,Detached house,Other flats,Semi detached house,Terrace house
0,0,752.60,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1,1,797.01,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
2,2,754.20,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,3,717.01,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,4,571.57,False,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [183]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 242970 entries, 0 to 243515
Columns: 461 entries, Unnamed: 0 to Terrace house
dtypes: bool(1), float64(1), int64(1), uint8(458)
memory usage: 111.9 MB

In [185]:
#Train data
X=dataset.drop('VALUE',axis=1)
Y=dataset['VALUE']

In [186]:
from sklearn.model_selection import train_test_split

In [187]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size=.25, random_state=42)

In [188]:
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(182227, 460)
(60743, 460)
(182227,)
(60743,)

In [189]:
from sklearn.neighbors import KNeighborsRegressor

In [190]:
KNN = KNeighborsRegressor(
    n_neighbors=5, weights='uniform', algorithm='kd_tree', leaf_size=30, p=2, metric='minkowski', n_jobs=-1
)

In [191]:
KNN.fit(X_train, Y_train)

KNeighborsRegressor(algorithm='kd_tree', n_jobs=-1)

In [192]:
Y_prediction = KNN.predict(X_test)

In [193]:
df = pd.DataFrame({'Real Values':Y_test, 'Predicted Values':Y_prediction})
df

        Real Values  Predicted Values
164448   478.880000        661.462205
115790   813.073036        742.477280
89801    956.210000       1099.538118
183564   786.079553        815.609642
203325   588.762038        575.799631
...             ...               ...
1708     690.730000        597.486882
23657    598.807324        637.288834
141929  1228.020000       1221.118000
50467    488.127790        693.036488
140999   516.707463        566.285113

[60743 rows x 2 columns]

In [194]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error

In [197]:
print("R-Sqaured: %.3f"
      % KNN.score(X_test,Y_test))

R-Sqaured: 0.769

In [198]:
print("Mean squared error: %.3f"
      % mean_squared_error(Y_test, Y_prediction))  # Test MSE

print("Mean absolute error: %.3f"
      % mean_absolute_error(Y_test, Y_prediction))

Mean squared error: 30762.910
Mean absolute error: 101.954